---
type: PointLocationOnCurve
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# PointLocationOnCurve

`Autodesk.Revit.DB.PointLocationOnCurve` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | PointLocationOnCurve | 2012 | `public PointLocationOnCurve ( PointOnCurveMeasurementType measType , double measValue , PointOnCurveMeasureFrom measFrom )` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | MeasureFrom | 2012 | `public PointOnCurveMeasureFrom MeasureFrom { get ; set ; }` |
| Property | MeasurementType | 2012 | `public PointOnCurveMeasurementType MeasurementType { get ; set ; }` |
| Property | MeasurementValue | 2012 | `public double MeasurementValue { get ; set ; }` |